'''
	[문제]
		아래 a리스트는 최근 주식의 변동을 저장한 값이다. 
		숫자들은 가격을 의미한다. 
		리스트의 값들 중 연속으로 가장 많이 오른 기간이 얼마인지 출력하시오.
	[예시]
		(1) 3, 1 은 떨어진 것이다.
		(2) 1, 2 는 오른 것이다.
		(3) 2, 7 는 오른 것이다.
		(4) 7, 2 는 떨어진 것이다. (여기까지 연속으로 가장 많이 오른 것은 2일이다.)
		(5) 2, 3 은 오른 것이다.
		(6) 3, 4 는 오른 것이다.
		(7) 4, 6 은 오른 것이다.
		(8) 6, 1 은 떨어진 것이다. (여기까지 연속으로 가장 많이 오른 것은 3일이다.)
	[정답]
		3일 
'''

a = [3, 1, 2, 7, 2, 3, 4, 6, 1]

max = 0
day = 0
for i in range(len(a)-1) :
    print(f'{a[i],a[i+1]}',end=' ')
    값 = a[i] - a[i+1]
    if 값 > 0 :
        print('떨어짐')
    else :
        print('오름')
        
    if 값 > max:
        max = 값
        day = i
        
print(f'{day}일')        
    