'''
    [문제]
         a이차리스트에 data의 값들만큼 1을 채워 넣으시오.
         단, 가로를 기준으로 오른쪽에서 왼쪽으로 저장하시오.
         결과를 사각형 모양으로 출력하시오.
    [예시]
        data = [5,3,7,3,9]
        
        [0,0,0,0,0,1,1,1,1,1]
        [0,0,0,0,0,0,0,1,1,1]
        [0,0,0,1,1,1,1,1,1,1]
        [0,0,0,0,0,0,0,1,1,1]
        [0,1,1,1,1,1,1,1,1,1]
         
'''
data = [5,3,7,3,9]
a = [
    [0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0]
]


for i in range(len(a)) :
    size = len(a[i])-1
    for j in range(size,size-data[i],-1):
        a[i][j] = 1
    print(a[i]) 